import random

NAMES = [
    "Анна",
    "Валерия",
    "Диана",
    "Ольга",
    "Светлана",
    "Татьяна",
    "Ирина",
    "Анастасия",
    "Елизавета",
    "Дарья",
    "Мария",
    "Марина"
    ]
    
PRODUCTS = [
    "диван Ralf 2х секц",
    "диван Ralf 3х секц",
    "диван Домо про 160",
    "диван Домо про 180",
    "диван монако",
    "диван локо про",
    "диван вега",
    "диван лагуна",
    "кровать рейчел 160",
    "кровать рейчел 180",
    "кровать рейчел 200",
    "кровать сильвана 160",
    "кровать сильванаа 180",
    "кровать сильвана 200",
    "кровать магика бокс 160",
    "кровать магика бокс 180",
    "кровать веста 160",
    "кровать веста 180",
    "кровать доменико 160",
    "кровать доменико 180",
    "кровать орландо 160",
    "кровать орландо 180",
    "кровать милана 160",
    "кровать милана 180",
    "матрас оригнал про 140",
    "матрас оригнал про 160",
    "матрас оригнал про 180",
    "матрас орто хард 140",
    "матрас орто хард 160",
    "матрас орто хард 180",
    "матрас денвер хард 140",
    "матрас денвер хард 160",
    "матрас денвер хард 180",
    "матрас атланта медиум 140",
    "матрас атланта медиум 160",
    "матрас атланта медиум 180",
    "матрас регал 160",
    "матрас регал 180"
    ]
    
def generate_phone():
    return f"+79{random.randint(10,89)}{random.randint(100,999)}{random.randint(10,99)}{random.randint(10,99)}"

def generate_lead():
    name = random.choice(NAMES)
    phone = generate_phone()
    comment = random.choice(PRODUCTS)
    return name, phone, comment
    
if __name__=="__main__":
    name, phone, comment = generate_lead()
    print(f"{name}|{phone}|{comment}")
    
